DataProcessors/ЗагрузкаАктовТиражныхПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаАктовТиражныхПодразделений</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабАктовРеализаций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Переносить</Name>
							<Comment>П</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоАкт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерАктаРеализации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Договор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОбеспечениеОплата</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фиктивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗадачиПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоСмете</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыГрафикаОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОтгрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтгрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктТиражногоПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>АктТиражногоПодразделения</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТирАиП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерАктаРеализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаАктовТиражныхПодразделений/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция КлиентНайтиКонтрагентаПоИННКПП(ИННКонтрагента, КППКонтрагента)
		Отбор = НОВЫЙ Структура("ИНН");
		Отбор.ИНН = ИННКонтрагента;
		
		Выборка = Справочники.Контрагенты.Выбрать( , , Отбор);
		Пока Выборка.Следующий() Цикл
			Если Выборка.КПП = КППКонтрагента Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		Возврат Неопределено;
КонецФункции
      
&НаСервереБезКонтекста
Функция НайтиДоговорПоНомеру( НомерДоговора, ДатаДоговора)
		Договор = Документы.Договор.НайтиПоНомеру( НомерДоговора, ДатаДоговора);
		Если Договор.Пустая() Тогда Возврат Неопределено; КонецЕсли;
		Возврат Договор;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиОрганизациюПоПрефиксу( Префикс );		
		Возврат Справочники.Организации.НайтиПоРеквизиту( "Префикс", Префикс);
КонецФункции

&НаКлиенте
Процедура ИзменитьФлажки( Таб,  Переносить )
	Для Каждого Стр Из Таб Цикл
		Стр.Переносить = Переносить;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ИзменитьФлажки( Объект.ТабАктовРеализаций, Истина );
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьФлажки( Объект.ТабАктовРеализаций,  Ложь );
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьПодразделение( ОЛЕПодразделение )
	Если ОЛЕПодразделение.Пустая() Тогда Возврат Неопределено; КонецЕсли;
	НаименованиеПодразделения = СокрЛП( ОЛЕПодразделение.Наименование );
	Если НЕ ЗначениеЗаполнено(НаименованиеПодразделения) Тогда Возврат Неопределено; КонецЕсли;
	
	Возврат ЗагрузитьПодразделение_НаСервере( НаименованиеПодразделения );
КонецФункции

&НаСервереБезКонтекста
Функция ЗагрузитьПодразделение_НаСервере( НаименованиеПодразделения )
	СпрСс = Справочники.Подразделения.НайтиПоНаименованию( НаименованиеПодразделения, Истина);
	Если СпрСс.Пустая() Тогда 
		СпРОб = Справочники.Подразделения.СоздатьЭлемент();
		СпрОб.Наименование = НаименованиеПодразделения;
		Попытка
			СпрОб.Записать();
			Возврат СпрОб.Ссылка;
		Исключение
			Сообщить("Не удалось записать подразделение " + НаименованиеПодразделения + ", " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
	Конецесли;
	Возврат СпрСс;
КонецФункции

&НаСервереБезКонтекста
Функция ЗагрузитьСотрудника( Название )			
	Возврат Справочники.ФизическиеЛица.НайтиПоНаименованию( Название, Истина );
КонецФункции

&НаСервереБезКонтекста
Функция ОрганизацияПоДоговору( Договор )
	Если ЗначениеЗаполнено( Договор ) Тогда
		Возврат Договор.Организация;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции


&НаКлиенте
Процедура ЗаполнитьТаблицуПоВидуДокумента_НаКлиенте(БазаОЛЕ, ВидДокумента )
	
	ВыборкаОЛЕ = БазаОЛЕ.Документы[ВидДокумента].Выбрать( НачалоДня(ПериодОтбора.ДатаНачала), КонецДня( ПериодОтбора.ДатаОкончания )); 

	Пока ВыборкаОЛЕ.Следующий()  Цикл
		// не проведен
		Если НЕ ВыборкаОЛЕ.Проведен	Тогда Продолжить; КонецЕсли;
		
		// аннулирован
		Аннулирован	= УП_ПереносДанных.ОЛЕЗначениеДопРеквизита( БазаОЛЕ, ВыборкаОЛЕ.Ссылка, "Аннулирован");
		Если Аннулирован = Неопределено Тогда
		// не указано, т.е не аннулирован
		ИначеЕсли Аннулирован 			Тогда 
			Продолжить; 
		КонецЕсли;
		
		// в реализацию
		ВРеализацию			= УП_ПереносДанных.ОЛЕЗначениеДопРеквизита( БазаОЛЕ, ВыборкаОЛЕ.Ссылка, "В реализацию");
		Если ВРеализацию = Неопределено Тогда
			Продолжить; // не указан
		ИначеЕсли Не ВРеализацию 		Тогда 
			Продолжить; 
		КонецЕсли;
		//
		// 		
		ИННКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.ИНН);
		КППКонтрагента 	= СокрЛП(ВыборкаОЛЕ.Контрагент.КПП);
		Контрагент 		= КлиентНайтиКонтрагентаПоИННКПП( ИННКонтрагента,  КППКонтрагента);
		Если Контрагент = Неопределено Тогда
			Сообщить("Нет контрагента с ИНН [" + ИННКонтрагента + "], КПП [" + КППКонтрагента +"]");
			Продолжить;
		КонецЕсли;
		
		СтрДок 						= Объект.ТабАктовРеализаций.Добавить();
		СтрДок.ЭтоАкт 				= (ВидДокумента = "АктВыполненныхРабот"); 	
		СтрДок.Дата					= ВыборкаОЛЕ.Дата;
		СтрДок.НомерАктаРеализации  = ВыборкаОЛЕ.Номер;
		СтрДок.Контрагент			= Контрагент;
		СтрДок.Договор				= НайтиДоговорПоНомеру( ВыборкаОЛЕ.ЗаказКлиента.Номер,	ВыборкаОЛЕ.ЗаказКлиента.Дата );
		СтрДок.Организация			= ОрганизацияПоДоговору( СтрДок.Договор );
		СтрДок.Подразделение 		= ЗагрузитьПодразделение( ВыборкаОЛЕ.Подразделение );
		
		
		// не заполняется в торговле, если будет то тип - физ.лицо
		ОЛЕФизЛицо				= УП_ПереносДанных.ОЛЕЗначениеДопРеквизита( БазаОЛЕ, ВыборкаОЛЕ.Ссылка, "Сотрудник");
		Если БазаОЛЕ.ЗначениеЗаполнено( ОЛЕФизЛицо ) Тогда
			СтрДок.ФизическоеЛицо	= ЗагрузитьФизическоеЛицо( БазаОЛЕ, ОЛЕФизЛицо );
		
		КонецЕсли;
		СтрДок.Сумма				= ВыборкаОЛЕ.СуммаДокумента;
		
	КонецЦикла;
	
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция ЗагрузитьФизическоеЛицо( БазаОЛЕ, ОЛЕФизЛицо )
	Если НЕ БазаОЛЕ.ЗначениеЗаполнено( ОЛЕФизЛицо ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	сФизическоеЛицо = Новый Структура;
	сФизическоеЛицо.Вставить("Код", 			ОЛЕФизЛицо.Наименование );
	сФизическоеЛицо.Вставить("Наименование", 	ОЛЕФизЛицо.Наименование);
	сФизическоеЛицо.Вставить("ДатаРождения", 	ОЛЕФизЛицо.ДатаРождения );
	сФизическоеЛицо.Вставить("Пол", 			(БазаОЛЕ.String(ОЛЕФизЛицо.Пол)= "Мужской"));
	
	Возврат УП_ПереносДанных.ЗагрузитьФизическоеЛицо( сФизическоеЛицо );

КонецФункции



&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	//
	БазаОЛЕ 	= УП_Клиент.КлиентПодключитьсяКБазеОЛЕ_ПоИмени( "УправлениеТорговлей" );
	Если БазаОЛЕ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//
	Объект.ТабАктовРеализаций.Очистить();
	
	ЗаполнитьТаблицуПоВидуДокумента_НаКлиенте(БазаОЛЕ, "АктВыполненныхРабот");
	
	// указание Голуба, 10,02,2013 - не переносим Реализации
	//ЗаполнитьТаблицуПоВидуДокумента_НаКлиенте(БазаОЛЕ, "РеализацияТоваровУслуг");
	
	БазаОЛЕ = "";
	ПоказатьПредупреждение(,"Таблица документов заполнена!", 10);
	
	
КонецПроцедуры


//*************************************************************************
//	Номер акта и реализации модет совпадать
//  
//	
//
//
&НаСервере
Процедура ЗагрузитьДокументы_НаСервере( )
	Для Каждого Док Из Объект.ТабАктовРеализаций Цикл
		Если НЕ Док.Переносить Тогда Продолжить; КонецЕсли;
		
		// ищем документ
		Отбор = Новый Структура;
		Отбор.Вставить("НомерАктаРеализации", Док.НомерАктаРеализации );
		ВыборкаДок = Документы.АктТиражногоПодразделения.Выбрать(НачалоГода(Док.Дата), КонецГода(Док.Дата), Отбор ); 
		Нашли = Ложь;
		Пока ВыборкаДок.Следующий() Цикл
			//Если ВыборкаДок.ЭтоАкт = Док.ЭтоАкт Тогда
				ДокОб = ВыборкаДок.Ссылка.ПолучитьОбъект();
				Нашли = Истина;
				Прервать;
			//КонецЕсли;
		КонецЦикла;
		//
		Если НЕ Нашли Тогда
			ДокОб 						= Документы.АктТиражногоПодразделения.СоздатьДокумент();
			ДокОб.Дата					= Док.Дата;
			//ДокОб.ЭтоАкт				= Док.ЭтоАкт;
			ДокОб.НомерАктаРеализации	= Док.НомерАктаРеализации;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств( ДокОб, Док );
		// 
		Док.Переносить				= Ложь;
		
		Попытка
			ДокОб.Записать( РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный );
		Исключение
			
			Сообщить( "Не удалось записать акт (реализацию)" + Док.НомерАктаРеализации +", " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументы(Команда)
	ЗагрузитьДокументы_НаСервере();
	ПоказатьПредупреждение(,"Акты и реализации загружена", 10);
КонецПроцедуры
